import { BookModel } from "@/types/models/book.models";

export const books: BookModel[] = [
  {
    id: "1",
    name: "شاهنامه",
    image:
      "https://dkstatics-public.digikala.com/digikala-products/cf527e0497507478b4994c651606949759b1a099_1655121343.jpg?x-oss-process=image/resize,m_lfit,h_800,w_800/format,webp/quality,q_90",
    year: 389,
    format: "چاپی",
    genre: "حماسی",
    categories: ["کلاسیک"],
    author: "فردوسی",
    price: "740000",
    inStock: true,
    brief:
      "شاهنامه، شاهکار بی‌بدیل فردوسی، یکی از بزرگ‌ترین آثار حماسی جهان به شمار می‌رود. این کتاب به زبان فارسی سروده شده و تاریخ ایران را از زمان‌های اسطوره‌ای تا دوران فتح اسلامی روایت می‌کند. شاهنامه مجموعه‌ای از داستان‌های پهلوانی، جنگ‌ها، عشق‌ها و روایت‌های اخلاقی است که با زبانی فاخر و شاعرانه بیان شده‌اند. هدف فردوسی از سرودن این اثر، احیای زبان فارسی و حفظ هویت ملی ایرانیان بوده است.",
    rating: 4.8,
    amount: 100,
    totalVotes: 250,
    comments: [
      {
        name: "ali",
        stars: 5,
        date: "2025-01-21T12:34:56.789Z",
        description: "کتاب فوق‌العاده‌ای است و من خیلی از مطالعه آن لذت بردم.",
      },
      {
        name: "yasi",
        stars: 4,
        date: "2025-05-21T12:34:56.789Z",
        description: "داستان‌های شاهنامه همیشه جذاب و آموزنده‌اند.",
      },
      {
        name: "hossein",
        stars: 3,
        date: "2025-01-21T12:34:56.789Z",
        description: "کتاب خوبی است، اما برخی بخش‌ها کمی طولانی بود.",
      },
    ],
  },
  {
    id: "2",
    name: "خسرو و شیرین",
    image:
      "https://dkstatics-public.digikala.com/digikala-products/065abdf025a21fdf9581cab77478edb8a12295d6_1632122208.jpg?x-oss-process=image/resize,m_lfit,h_800,w_800/format,webp/quality,q_90",
    year: 559,
    format: "چاپی",
    genre: "عاشقانه",
    categories: ["حماسه عاشقانه", "کلاسیک"],
    author: "نظامی گنجوی",
    price: "520000",
    inStock: true,
    brief:
      "خسرو و شیرین یکی از معروف‌ترین آثار نظامی گنجوی است که داستان عشق خسرو پرویز، شاه ایران، و شیرین، شاهزاده ارمنی را روایت می‌کند. این اثر به سبک مثنوی نوشته شده و از ظرافت‌های ادبی و تمثیل‌های فراوان برخوردار است. داستان، عشق پرشور خسرو و تلاش‌های او برای رسیدن به شیرین را توصیف می‌کند. خسرو و شیرین نه تنها اثری عاشقانه بلکه شاهکاری از هنر داستان‌سرایی فارسی است که از قرن‌ها پیش تا امروز همچنان مورد توجه قرار دارد.",
    rating: 4.7,
    amount: 80,
    totalVotes: 180,
    comments: [
      {
        name: "ali",
        stars: 5,
        date: "2025-01-21T12:34:56.789Z",
        description:
          "عشق و زیبایی در این کتاب به بهترین شکل به تصویر کشیده شده است.",
      },
      {
        name: "yasi",
        stars: 4,
        date: "2025-05-21T12:34:56.789Z",
        description:
          "داستان عاشقانه خوبی است، اما انتهای آن کمی تکراری به نظر می‌رسد.",
      },
      {
        name: "hossein",
        stars: 3,
        date: "2025-01-21T12:34:56.789Z",
        description: "کتاب جالبی است، اما برخی از قسمت‌ها خیلی کشدار است.",
      },
    ],
  },
  {
    id: "3",
    name: "بوف کور",
    image: "https://example.com/blind-owl.jpg",
    year: 1315,
    format: "چاپی",
    genre: "سوررئالیسم",
    categories: ["رمان", "مدرن"],
    author: "صادق هدایت",
    price: "720000",
    inStock: false,
    brief:
      "بوف کور، شاهکاری سوررئالیستی از صادق هدایت، یکی از برجسته‌ترین نویسندگان مدرن ایران است. این رمان مضامینی چون تنهایی، ناامیدی و بی‌معنایی زندگی را از دید یک راوی غیرقابل‌اعتماد بررسی می‌کند. داستان با توصیف فضایی تاریک و رازآلود آغاز می‌شود که به تدریج وارد دنیای درونی شخصیت اصلی می‌شود. بوف کور به دلیل سبک منحصربه‌فرد و محتوای عمیق فلسفی، به عنوان اثری تاثیرگذار در ادبیات فارسی شناخته می‌شود.",
    rating: 4.6,
    amount: 50,
    totalVotes: 200,
    comments: [
      {
        name: "ali",
        stars: 5,
        date: "2025-01-21T12:34:56.789Z",
        description:
          "کتاب بسیار تاثیرگذاری است، حس تنهایی و سرگشتگی را به خوبی منتقل می‌کند.",
      },
      {
        name: "yasi",
        stars: 4,
        date: "2025-05-21T12:34:56.789Z",
        description: "سبک نوشتاری خاص و جذاب است، ولی پایان آن کمی مبهم است.",
      },
      {
        name: "hossein",
        stars: 3,
        date: "2025-01-21T12:34:56.789Z",
        description:
          "این کتاب به نوعی سنگین و فلسفی است، ممکن است برای همه جذاب نباشد.",
      },
    ],
  },
  {
    id: "4",
    name: "چشم‌هایش",
    image:
      "https://dkstatics-public.digikala.com/digikala-products/a944a98d040292e0422d2a6014aaa8a7c420f578_1599550628.jpg?x-oss-process=image/resize,m_lfit,h_800,w_800/format,webp/quality,q_90",
    year: 1331,
    format: "چاپی",
    genre: "عاشقانه-سیاسی",
    categories: ["رمان", "مدرن"],
    author: "بزرگ علوی",
    price: "580000",
    inStock: true,
    brief:
      "چشم‌هایش شاهکاری از بزرگ علوی، یکی از پیشگامان رمان‌نویسی مدرن فارسی است. این رمان داستانی عاشقانه و سیاسی را در قالب یک روایت پر رمز و راز به تصویر می‌کشد. محور اصلی داستان، نقاشی چشم‌های زنی مرموز است که زندگی و عشق او با مسائل سیاسی و اجتماعی دوران پهلوی در هم آمیخته است. علوی با مهارتی بی‌نظیر، عشق، تنهایی و مبارزه برای عدالت را در این اثر جاودانه کرده است.",
    rating: 4.7,
    amount: 85,
    totalVotes: 190,
    comments: [
      {
        name: "ali",
        stars: 5,
        date: "2025-01-21T12:34:56.789Z",
        description:
          "اثر بسیار برجسته‌ای است که مسائل اجتماعی و سیاسی را به خوبی با هم ترکیب می‌کند.",
      },
      {
        name: "yasi",
        stars: 4,
        date: "2025-05-21T12:34:56.789Z",
        description:
          "کتاب جذابی است، اما برخی از قسمت‌های آن نیاز به تمرکز بیشتری دارد.",
      },
      {
        name: "hossein",
        stars: 3,
        date: "2025-01-21T12:34:56.789Z",
        description:
          "داستان جالبی بود، اما پیچیدگی‌های سیاسی آن را کمی سخت‌فهم می‌کند.",
      },
    ],
  },
  {
    id: "5",
    name: "منطق الطیر",
    image:
      "https://dkstatics-public.digikala.com/digikala-products/3fb6cc918bd0f07ee096b8155b6d655d8c657da1_1718546660.jpg?x-oss-process=image/resize,m_lfit,h_800,w_800/format,webp/quality,q_90",
    year: 555,
    format: "چاپی",
    genre: "عرفانی",
    categories: ["صوفیانه", "کلاسیک"],
    author: "عطار نیشابوری",
    price: "600000",
    inStock: true,
    brief:
      "منطق الطیر، شاهکار عطار نیشابوری، یکی از مهم‌ترین آثار عرفانی در ادبیات فارسی است. این کتاب داستان گروهی از پرندگان را روایت می‌کند که در جستجوی سیمرغ، نماد حقیقت مطلق، سفر می‌کنند. هر کدام از پرندگان نمایانگر خصوصیات و ضعف‌های انسانی هستند. این اثر با تمثیل‌های عمیق و زبانی شاعرانه، به بررسی ماهیت عشق الهی، خودشناسی و معنای زندگی می‌پردازد. منطق الطیر به عنوان یکی از برجسته‌ترین آثار صوفیانه شناخته می‌شود.",
    rating: 4.9,
    amount: 120,
    totalVotes: 300,
    comments: [
      {
        name: "ali",
        stars: 5,
        date: "2025-01-21T12:34:56.789Z",
        description:
          "این کتاب بسیار آموزنده است و به مفاهیم عمیق عرفانی می‌پردازد.",
      },
      {
        name: "yasi",
        stars: 4,
        date: "2025-05-21T12:34:56.789Z",
        description: "داستانی زیبا با پیامی عمیق که باعث تفکر می‌شود.",
      },
      {
        name: "hossein",
        stars: 3,
        date: "2025-01-21T12:34:56.789Z",
        description:
          "کتاب خوب است، ولی برای درک بهتر نیاز به مطالعه دقیق‌تر دارد.",
      },
    ],
  },
  {
    id: "6",
    name: "دیوان شمس تبریزی",
    image:
      "https://dkstatics-public.digikala.com/digikala-products/aed64f5a84cea2bb29b239d0f68eb8e456e5f4fc_1609679205.jpg?x-oss-process=image/resize,m_lfit,h_800,w_800/format,webp/quality,q_90",
    year: 626,
    format: "چاپی",
    genre: "عرفانی",
    categories: ["صوفیانه", "کلاسیک"],
    author: "مولوی",
    price: "780000",
    inStock: false,
    brief:
      "دیوان شمس تبریزی، مجموعه‌ای از اشعار مولوی است که به شمس تبریزی، استاد روحانی او تقدیم شده است. این اثر شامل غزلیات عاشقانه و عارفانه است که مضامینی چون عشق الهی، وحدت وجود و معنای زندگی را بررسی می‌کند. مولوی در این دیوان با زبانی پرشور و شاعرانه، عمیق‌ترین مفاهیم عرفانی را بیان کرده است. دیوان شمس تبریزی یکی از مهم‌ترین آثار ادبیات فارسی و عرفان اسلامی است.",
    rating: 4.8,
    amount: 90,
    totalVotes: 220,
    comments: [
      {
        name: "ali",
        stars: 5,
        date: "2025-01-21T12:34:56.789Z",
        description:
          "دیوانی پر از اشعار عاشقانه و عرفانی که حقیقت را نمایان می‌کند.",
      },
      {
        name: "yasi",
        stars: 4,
        date: "2025-05-21T12:34:56.789Z",
        description:
          "اشعار مولوی همیشه تاثیرگذار هستند، به خصوص در زمینه عرفان.",
      },
      {
        name: "hossein",
        stars: 3,
        date: "2025-01-21T12:34:56.789Z",
        description:
          "کتاب زیبا است، ولی برای فهم بهتر نیاز به مطالعه عمیق‌تری دارد.",
      },
    ],
  },
  {
    id: "7",
    name: "ماهی سیاه کوچولو",
    image:
      "https://dkstatics-public.digikala.com/digikala-products/cbf03093cbbbd0cf34d9c60f05257bd898e8a8b5_1683623320.jpg?x-oss-process=image/resize,m_lfit,h_800,w_800/format,webp/quality,q_90",
    year: 1346,
    format: "چاپی",
    genre: "کودکانه",
    categories: ["کودک", "مدرن"],
    author: "صمد بهرنگی",
    price: "430000",
    inStock: true,
    brief:
      "ماهی سیاه کوچولو یکی از داستان‌های مشهور صمد بهرنگی است که با زبانی ساده و در عین حال فلسفی، مفاهیم عمیق اجتماعی و سیاسی را بیان می‌کند. این داستان روایت‌گر سفر یک ماهی کوچک به دنیایی بزرگ‌تر است که او را با چالش‌ها و ناشناخته‌های بسیاری روبه‌رو می‌کند. ماهی سیاه کوچولو با پیامی درباره آزادی، جستجو و تغییر، به عنوان یکی از آثار برجسته ادبیات کودکان ایران شناخته می‌شود.",
    rating: 4.6,
    amount: 150,
    totalVotes: 300,
    comments: [
      {
        name: "ali",
        stars: 5,
        date: "2025-01-21T12:34:56.789Z",
        description:
          "داستان بسیار آموزنده‌ای است که مفاهیم آزادی و تغییر را به خوبی بیان می‌کند.",
      },
      {
        name: "yasi",
        stars: 4,
        date: "2025-05-21T12:34:56.789Z",
        description:
          "کتاب جالبی است که مفاهیم فلسفی را برای کودکان به خوبی بیان می‌کند.",
      },
      {
        name: "hossein",
        stars: 3,
        date: "2025-01-21T12:34:56.789Z",
        description:
          "کتاب خوبی است، اما ممکن است برای برخی افراد مفاهیم آن کمی پیچیده باشد.",
      },
    ],
  },
];
